NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG24/EFR32MG24A020F1536GM48.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MVP_S</name>
      <version>1</version>
      <description>MVP_S Registers</description>
      <baseAddress>0x4D000000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IPVERSION</name>
          <description>IP Version Register</description>
          <addressOffset>0x000</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IPVERSION</name>
              <description>IP Version ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EN</name>
          <description>Block Enable Register</description>
          <addressOffset>0x004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISABLING</name>
              <description>Disablement Busy Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWRST</name>
          <description>Software Reset Register</description>
          <addressOffset>0x008</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset Command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RESETTING</name>
              <description>Software Reset Busy Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>Configuration Register</description>
          <addressOffset>0x00C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FF000F</resetMask>
          <fields>
            <field>
              <name>PERFCNTEN</name>
              <description>Performance Counter Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTCOMPRESSDIS</name>
              <description>ALU Output Stream Compression Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INCACHEDIS</name>
              <description>ALU Input Word Cache Disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOPERRHALTDIS</name>
              <description>Loop Error Halt Disable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PERF0CNTSEL</name>
              <description>Performance Counter Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>Total run count</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD</name>
                  <description>Total Commands Issued</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STALL</name>
                  <description>Total stall count (at sequencer issue)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOOP</name>
                  <description>NOOP ALU Op counter</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALUACTIVE</name>
                  <description>Count cycles that ALU is active (not stalled), excluding NOOPs</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIPESTALL</name>
                  <description>Stalls caused by register and resource conflicts within the ALU.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOFENCESTALL</name>
                  <description>Count stall cycles caused by memory hazards</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOAD0STALL</name>
                  <description>Count stall cycles when accessing memory from load stream 0</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOAD1STALL</name>
                  <description>Count stall cycles when accessing memory from load stream 1</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STORESTALL</name>
                  <description>Count stall cycles when writing memory from store stream</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSSTALL</name>
                  <description>Count cycles where any of previous 3 events is occurring</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOAD0AHBSTALL</name>
                  <description>All stall cycles on load bus 0 AHB interface</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOAD1AHBSTALL</name>
                  <description>All stall cycles on load bus 1 AHB interface</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOAD0FENCESTALL</name>
                  <description>LOAD0 Fence Stall cycles</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOAD1FENCESTALL</name>
                  <description>LOAD1 Fence Stall cycles</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PERF1CNTSEL</name>
              <description>Performance Counter Select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>Total run count</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD</name>
                  <description>Total Commands Issued</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STALL</name>
                  <description>Total stall count (at sequencer issue)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOOP</name>
                  <description>NOOP ALU Op counter</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALUACTIVE</name>
                  <description>Count cycles that ALU is active (not stalled), excluding NOOPs</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIPESTALL</name>
                  <description>Stalls caused by register and resource conflicts within the ALU.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOFENCESTALL</name>
                  <description>Count stall cycles caused by memory hazards</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOAD0STALL</name>
                  <description>Count stall cycles when accessing memory from load stream 0</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOAD1STALL</name>
                  <description>Count stall cycles when accessing memory from load stream 1</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STORESTALL</name>
                  <description>Count stall cycles when writing memory from store stream</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSSTALL</name>
                  <description>Count cycles where any of previous 3 events is occurring</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOAD0AHBSTALL</name>
                  <description>All stall cycles on load bus 0 AHB interface</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOAD1AHBSTALL</name>
                  <description>All stall cycles on load bus 1 AHB interface</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOAD0FENCESTALL</name>
                  <description>LOAD0 Fence Stall cycles</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOAD1FENCESTALL</name>
                  <description>LOAD1 Fence Stall cycles</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status Register</description>
          <addressOffset>0x010</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>RUNNING</name>
              <description>Running Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PAUSED</name>
              <description>Paused Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDLE</name>
              <description>Idle Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PERF0CNT</name>
          <description>Run Counter</description>
          <addressOffset>0x014</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>COUNT</name>
              <description>Performance Counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PERF1CNT</name>
          <description>Run Counter</description>
          <addressOffset>0x018</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>COUNT</name>
              <description>Performance Counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>Interrupt Flags</description>
          <addressOffset>0x01C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1F0FFDFF</resetMask>
          <fields>
            <field>
              <name>PROGDONE</name>
              <description>Program Done Interrupt Flags</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOP0DONE</name>
              <description>Loop Done Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOP1DONE</name>
              <description>Loop Done Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOP2DONE</name>
              <description>Loop Done Interrupt Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOP3DONE</name>
              <description>Loop Done Interrupt Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOP4DONE</name>
              <description>Loop Done Interrupt Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOP5DONE</name>
              <description>Loop Done Interrupt Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOP6DONE</name>
              <description>Loop Done Interrupt Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOP7DONE</name>
              <description>Loop Done Interrupt Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALUNAN</name>
              <description>Not-a-Number Interrupt Flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>R0POSREAL</name>
              <description>R0 non-zero Interrupt Flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALUOF</name>
              <description>ALU Overflow on result</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALUUF</name>
              <description>ALU Underflow on result</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STORECONVERTOF</name>
              <description>Overflow during array store</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STORECONVERTUF</name>
              <description>Underflow during array store conversion</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STORECONVERTINF</name>
              <description>Infinity encountered during array store conversion</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STORECONVERTNAN</name>
              <description>NaN encountered during array store conversion</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PERFCNT0</name>
              <description>Run Count Overflow Interrupt Flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PERFCNT1</name>
              <description>Stall Count Overflow Interrupt Flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOPFAULT</name>
              <description>Loop Fault Interrupt Flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSERRFAULT</name>
              <description>Bus Error Fault Interrupt Flag</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSALIGNFAULT</name>
              <description>Bus Alignment Fault Interrupt Flag</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALUFAULT</name>
              <description>ALU Fault Interrupt Flag</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAYFAULT</name>
              <description>Array Fault Interrupt Flag</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
